# Pandas Giriş
* Panel Data
* Veri manipülasyonu ve veri analizi için yazılmış açık kaynak kodlu bir Python kütüphanesidir.
* Ekonometrik ve finansal çalışmalar için geliştirilmiştir.
* R DataFrame yapısını Python dünyasına taşımış ve DataFrame'ler ile çalışabilme imkanı sağlamıştır.
* Bir çok farklı veri tipini okuma ve yazma imkanı sağlar.

### Pandas Serisi Oluşturmak

In [2]:
import pandas as pd

In [3]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
# Pandas icerisinde veri tipleri degerleri indexleri ile birlikte tutar.

In [5]:
seri = pd.Series([1,2,3,4,5])

In [7]:
type(seri)

pandas.core.series.Series

In [9]:
seri.axes #seri hakkinda genel bilgi verir

[RangeIndex(start=0, stop=5, step=1)]

In [10]:
seri.dtype # serideki degerlerin veri tipini verir

dtype('int64')

In [11]:
seri.size # serinin eleman sayisini verir

5

In [12]:
seri.ndim # boyut bilgisini verir

1

In [14]:
seri.values # indexler olmadan degerlere erisim saglar

array([1, 2, 3, 4, 5], dtype=int64)

In [16]:
seri.head(3) # serinin ilk n satirini getirir

0    1
1    2
2    3
dtype: int64

In [17]:
seri.tail(3) # serinin sondan n elemaini getirir

2    3
3    4
4    5
dtype: int64

In [18]:
# index isimlendirmesi

In [19]:
pd.Series([99,22,332,94,67])

0     99
1     22
2    332
3     94
4     67
dtype: int64

In [21]:
pd.Series([99,22,332,94,67], index=[1,3,5,7,9])

1     99
3     22
5    332
7     94
9     67
dtype: int64

In [22]:
pd.Series([99,22,332,94,67], index=["a","b","c","d","e"])

a     99
b     22
c    332
d     94
e     67
dtype: int64

In [23]:
seri = pd.Series([99,22,332,94,67], index=["a","b","c","d","e"])

In [24]:
seri["a"]

99

In [25]:
seri["a":"c"]

a     99
b     22
c    332
dtype: int64

In [26]:
# Sozluk (dictionary) uzerinden seri olusturmak

In [29]:
sozluk = pd.Series({"reg":10, "loj":11, "cart":12})
sozluk

reg     10
loj     11
cart    12
dtype: int64

In [33]:
sozluk = {"reg":10, "loj":11, "cart":12}
seri = pd.Series(sozluk)
seri

reg     10
loj     11
cart    12
dtype: int64

In [34]:
# iki seriyi birlestirerek serei olusturma

In [35]:
pd.concat([seri,seri])

reg     10
loj     11
cart    12
reg     10
loj     11
cart    12
dtype: int64

### Eleman İşlemleri

In [36]:
import numpy as np
import pandas as pd
a = np.array([11,72,33,444,75])
seri = pd.Series(a)
seri

0     11
1     72
2     33
3    444
4     75
dtype: int32

In [37]:
seri[0]

11

In [38]:
seri[1:4]

1     72
2     33
3    444
dtype: int32

In [40]:
seri = pd.Series([121,200,150,99], index = ["reg", "loj", "cart", "rf"])
seri

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [41]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [42]:
seri.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [43]:
list(seri.items()) # key-value degerlerini birlikte listle olarak verir

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [44]:
# eleman sorgulama

In [45]:
"reg" in seri

True

In [46]:
"a" in seri

False

In [48]:
# fancy ile eleman secme

In [49]:
seri[["rf","reg"]]

rf      99
reg    121
dtype: int64

### Pandas DataFrame Oluşturma

In [50]:
import pandas as pd

In [51]:
l = [1,2,39,67,90]
l

[1, 2, 39, 67, 90]

In [52]:
pd.DataFrame(l,columns = ["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             39
3             67
4             90

In [54]:
# cok degiskenli dataframe

In [53]:
import numpy as np
m = np.arange(1,10).reshape(3,3)
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [55]:
pd.DataFrame(m,columns = ["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [56]:
# df (dataframe) isimlendirme

In [57]:
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [58]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [60]:
df.columns = ("deg1","deg2","deg3")
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [64]:
# df ozeliklerine erisim

In [61]:
type(df)

pandas.core.frame.DataFrame

In [63]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [65]:
df.shape

(3, 3)

In [66]:
df.ndim

2

In [67]:
df.size

9

In [68]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [69]:
type(df.values)

numpy.ndarray

In [70]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [72]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

### Eleman İşlemleri

In [74]:
import numpy as np
import pandas as pd

In [75]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [76]:
sozluk = {"var1":s1, "var2":s2, "var3":s3}
sozluk

{'var1': array([6, 2, 7, 7, 8]),
 'var2': array([1, 0, 7, 7, 9]),
 'var3': array([6, 7, 5, 5, 5])}

In [79]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     6     1     6
1     2     0     7
2     7     7     5
3     7     7     5
4     8     9     5

In [80]:
df = pd.DataFrame(sozluk, index = ["a","b","c","d","e"])
df

   var1  var2  var3
a     6     1     6
b     2     0     7
c     7     7     5
d     7     7     5
e     8     9     5

In [81]:
df["c":"e"]

   var1  var2  var3
c     7     7     5
d     7     7     5
e     8     9     5

In [118]:
# gozlem silme islemi

In [83]:
df.drop("a", axis = 0)

   var1  var2  var3
b     2     0     7
c     7     7     5
d     7     7     5
e     8     9     5

In [84]:
df

   var1  var2  var3
a     6     1     6
b     2     0     7
c     7     7     5
d     7     7     5
e     8     9     5

In [105]:
# yukarıda yaptigimiz silme islemi dataframede kalici bir degisiklik yapmadı
# bu degisikligin kalici olmasi icin yeniden atama islemi yapabiliriz
# veya 'inplace' argumanini kullanabiliriz

In [86]:
df.drop("a", axis = 0, inplace = True)
df

   var1  var2  var3
b     2     0     7
c     7     7     5
d     7     7     5
e     8     9     5

In [88]:
# fancy

In [89]:
l = ["c","d"]

In [90]:
df.drop(l, axis = 0)

   var1  var2  var3
b     2     0     7
e     8     9     5

In [98]:
# degiskenler icin

In [94]:
"var1" in df

True

In [95]:
l = ["var1","var2","var4"]

In [96]:
for i in l:
    print(i in df)

True
True
False

In [99]:
df

   var1  var2  var3
b     2     0     7
c     7     7     5
d     7     7     5
e     8     9     5

In [110]:
df["var4"] = df["var1"]/df["var2"]
df

   var1  var2  var3      var4
b     2     0     7       inf
c     7     7     5  1.000000
d     7     7     5  1.000000
e     8     9     5  0.888889

In [117]:
# degisken silme islemi

In [111]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     2     0     7
c     7     7     5
d     7     7     5
e     8     9     5

In [112]:
df

   var1  var2  var3      var4
b     2     0     7       inf
c     7     7     5  1.000000
d     7     7     5  1.000000
e     8     9     5  0.888889

In [113]:
df.drop("var4", axis = 1, inplace = True)
df

   var1  var2  var3
b     2     0     7
c     7     7     5
d     7     7     5
e     8     9     5

In [114]:
# fancy ile

In [115]:
l = ["var1","var2"]

In [116]:
df.drop(l, axis = 1)

   var3
b     7
c     5
d     5
e     5

### Gözlem ve Değişken Seçimi: loc & iloc

In [120]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    14     9    25
1     7     6    12
2     1    26    17
3     9     1    10
4    13    28     5
5    18    29    23
6    17    23    10
7    17     1    20
8    21     5    24
9    25    13    12

In [121]:
# loc: tanimlandigi sekli ile secim yapmak icin kulalnilir

In [122]:
df.loc[0:3]

   var1  var2  var3
0    14     9    25
1     7     6    12
2     1    26    17
3     9     1    10

In [123]:
# iloc: alisik oldugumuz indexleme mantigi ile secim yapar

In [124]:
df.iloc[0:3]

   var1  var2  var3
0    14     9    25
1     7     6    12
2     1    26    17

In [125]:
df.iloc[0,0]

14

In [126]:
df.iloc[0:3,0:2]

   var1  var2
0    14     9
1     7     6
2     1    26

In [127]:
df.loc[0:3, "var3"]

0    25
1    12
2    17
3    10
Name: var3, dtype: int32

In [132]:
df.iloc[0:3]["var3"]

0    25
1    12
2    17
Name: var3, dtype: int32

In [133]:
df.iloc[0:3, 1:3]

   var2  var3
0     9    25
1     6    12
2    26    17

In [131]:
df["var1"]

0    14
1     7
2     1
3     9
4    13
5    18
6    17
7    17
8    21
9    25
Name: var1, dtype: int32

### Koşullu Elemam İşlemleri

In [134]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     3    25    25
1     4    20     7
2     4    16    26
3    28     7    10
4    13     9    24
5    21     8    22
6    29    28    19
7     7    13     1
8    26    14    11
9     7    17    14

In [138]:
df[df.var1 > 5]

   var1  var2  var3
3    28     7    10
4    13     9    24
5    21     8    22
6    29    28    19
7     7    13     1
8    26    14    11
9     7    17    14

In [140]:
df[(df.var1>5) & (df.var3<5)]

   var1  var2  var3
7     7    13     1

In [143]:
df.loc[(df.var1>5), ["var1","var2"]]

   var1  var2
3    28     7
4    13     9
5    21     8
6    29    28
7     7    13
8    26    14
9     7    17

In [145]:
df[(df.var1>5)][["var1","var2"]]

   var1  var2
3    28     7
4    13     9
5    21     8
6    29    28
7     7    13
8    26    14
9     7    17

### Birleştirme (Join) İşlemleri

In [168]:
import numpy as np
import pandas as pd
m =np.random.randint(1,30, size =(5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0    26    13     4
1    24     6    11
2    20    24     6
3     7    16     6
4    19     2     1

In [169]:
df2 = df1 + 99
df2

   var1  var2  var3
0   125   112   103
1   123   105   110
2   119   123   105
3   106   115   105
4   118   101   100

In [170]:
pd.concat([df1,df2])

   var1  var2  var3
0    26    13     4
1    24     6    11
2    20    24     6
3     7    16     6
4    19     2     1
0   125   112   103
1   123   105   110
2   119   123   105
3   106   115   105
4   118   101   100

In [153]:
?pd.concat

Signature:
pd.concat(
    objs: 'Iterable[Series | DataFrame] | Mapping[HashableT, Series | DataFrame]',
    *,
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys: 'Iterable[Hashable] | None' = None,
    levels=None,
    names: 'list[HashableT] | None' = None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool | None' = None,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis.

Allows optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned. One exception to
    this is when the non-concatentation axis is a DatetimeIndex and join='outer'
    and the axis is not already aligned. In that case, the non-concatenation
    axis is always sorted lexicographically.
copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

It is not recommended to build DataFrames by adding single rows in a
for loop. Build a list of rows and make a DataFrame in a single concat.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']

Append a single row to the end of a ``DataFrame`` object.

>>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
>>> df7
    a   b
0   1   2
>>> new_row = pd.Series({'a': 3, 'b': 4})
>>> new_row
a    3
b    4
dtype: int64
>>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
    a   b
0   1   2
1   3   4
File:      c:\programdata\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [171]:
# birlestirme sirasinda olusan index sorununu cozme
pd.concat([df1,df2],  ignore_index = True)

   var1  var2  var3
0    26    13     4
1    24     6    11
2    20    24     6
3     7    16     6
4    19     2     1
5   125   112   103
6   123   105   110
7   119   123   105
8   106   115   105
9   118   101   100

In [172]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [173]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [174]:
df2.columns = ["var1","var2","deg3"]

In [175]:
# bir veri setinin diger veri serinde bir karsiligi yoksa bu birlestirme hatali olacaktır

In [176]:
pd.concat([df1,df2], ignore_index = True)

   var1  var2  var3   deg3
0    26    13   4.0    NaN
1    24     6  11.0    NaN
2    20    24   6.0    NaN
3     7    16   6.0    NaN
4    19     2   1.0    NaN
5   125   112   NaN  103.0
6   123   105   NaN  110.0
7   119   123   NaN  105.0
8   106   115   NaN  105.0
9   118   101   NaN  100.0

In [177]:
# bu durumda iki veri setinin kesisimlerini baz alarak bir birlestirme islemi yapabiliriz

In [178]:
pd.concat([df1,df2], join = "inner")

   var1  var2
0    26    13
1    24     6
2    20    24
3     7    16
4    19     2
0   125   112
1   123   105
2   119   123
3   106   115
4   118   101

In [180]:
# birlestirme islemini df in birisine gore yapmak istedigimizde
pd.concat([df1,df2], join_axes = [df1.columns])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [183]:
# join_axes argumani artik desteklenmiyormuş :(

In [188]:
df2_reindexed = df2.reindex(columns=df1.columns)
sonuc = pd.concat([df1, df2_reindexed], ignore_index = True)
sonuc

   var1  var2  var3
0    26    13   4.0
1    24     6  11.0
2    20    24   6.0
3     7    16   6.0
4    19     2   1.0
5   125   112   NaN
6   123   105   NaN
7   119   123   NaN
8   106   115   NaN
9   118   101   NaN

### İleri Birleştirme İşlemleri

In [189]:
import pandas as pd

In [193]:
# birebir birlestirme
# iki veri setinde de birebir ayni elemanlar old yapilabilir

In [191]:
df1 = pd.DataFrame({"calisanlar":["Ali","Veli","Ayse","Fatma"],
                    "grup":["Muhasebe","Muhendislik","Muhendislik","IK"]})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [192]:
df2 = pd.DataFrame({"calisanlar":["Ali","Veli","Ayse","Fatma"],
                    "ilk_giris":[2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2009
2       Ayse       2014
3      Fatma       2019

In [194]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [197]:
# coktan teke (many to one)

In [198]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [199]:
df4 = pd.DataFrame({"grup":["Muhasebe","Muhendislik","IK"],
                    "mudur":["Caner","Mustafa","Berkcan"]})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [200]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2010    Caner
1       Veli  Muhendislik       2009  Mustafa
2       Ayse  Muhendislik       2014  Mustafa
3      Fatma           IK       2019  Berkcan

In [ ]:
# coktan coka (many to many)

In [204]:
df5 = pd.DataFrame({"grup":["Muhasebe","Muhasebe","Muhendislik","Muhendislik","IK","IK"],
     "yetenekler":["matematik","excel","kodlama","linux","excel","yonetim"]})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           IK      excel
5           IK    yonetim

In [205]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           IK      excel
7      Fatma           IK    yonetim

### Toplulaştırma ve Gruplama (Aggregation & Grouping)
Basit toplulaştırma fonksiyonları:
* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* sdt()
* var()
* sum()

In [232]:
import seaborn as sns
df = sns.load_dataset("planets")

In [208]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [209]:
df.shape

(1035, 6)

In [214]:
df[["number","orbital_period","mass","distance","year"]].mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [216]:
df["mass"].mean()

2.6381605847953216

In [217]:
df["mass"].min()

0.0036

In [218]:
df["mass"].max()

25.0

In [219]:
df["mass"].sum()

1353.37638

In [220]:
df["mass"].std()

3.8186166509616046

In [221]:
df["mass"].var()

14.58183312700122

In [222]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [223]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [226]:
# verilerin icindeki eksisk degerleri silerek betimsel istatistiklere bakma

In [225]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

#### Gruplama İşlemleri

In [234]:
# gruplama islemi icin kategorik veriler kullanilir
# gruplama islemleri birlestirme islemleriyle birlikte kullanililr

In [228]:
df = pd.DataFrame({"gruplar": ["A","B","C","A","B","C"],
                   "veri":[10,11,52,23,43,55]}, columns = ["gruplar","veri"])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [229]:
df.groupby("gruplar")

In [230]:
df.groupby("gruplar").mean()

         veri
gruplar
A        16.5
B        27.0
C        53.5

In [231]:
df.groupby("gruplar").sum()

         veri
gruplar
A          33
B          54
C         107

In [233]:
import seaborn as sns
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [236]:
df.groupby("method")

In [239]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

### İleri Toplulaştırma İşlemleri (Aggregate, filter, transform, apply)

In [243]:
import pandas as pd
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                   "degisken1":[10,23,33,22,11,99],
                   "degisken2":[100,253,333,262,11,969]},
                  columns = ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11         11
5       C         99        969

#### aggregate()
Ne işe yarar?
- Belirli bir grup içindeki istediğimiz istatistiksel özetleri çıkarmak (örneğin: min, max, ortalama, medyan).
- Her gruba farklı bir işlem uygulamak.
- Veriyi daha anlamlı hale getirmek için filtrelenmiş ve özetlenmiş sonuçlar üretmek.

In [254]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      132.0
C             66.0      651.0

In [252]:
df.groupby("gruplar").aggregate(["min", "median", "max"])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23        11  132.0  253
C              33   66.0  99       333  651.0  969

In [253]:
df.groupby("gruplar").aggregate({"degisken1":"min","degisken2":"max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

#### filter()

 groupby() ile oluşturulan gruplar üzerinde çalışır ve belirttiğimiz bir koşulu sağlayan grupları döndürür.

In [256]:
import pandas as pd
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                   "degisken1":[10,23,33,22,11,99],
                   "degisken2":[100,253,333,262,11,969]},
                  columns = ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11         11
5       C         99        969

In [257]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [258]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

#### transform()
Amaç: Grup bazlı işlemler yaparken, her satıra göre dönüştürülmüş bir değer üretmek.
Yani aggregate() gibi grubu özetlemez, her satırın kendi dönüşümünü sağlar.

In [260]:
import pandas as pd
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                   "degisken1":[10,23,33,22,11,99],
                   "degisken2":[100,253,333,262,11,969]},
                  columns = ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11         11
5       C         99        969

In [261]:
df_a = df.iloc[:,1:3]

In [264]:
df_a.transform(lambda x: (x-x.mean())/x.std() )

   degisken1  degisken2
0  -0.687871  -0.653761
1  -0.299074  -0.201839
2   0.000000   0.034460
3  -0.328982  -0.175255
4  -0.657963  -0.916644
5   1.973890   1.913039

#### apply()
apply() bir lambda fonksiyonu veya tanımlı bir fonksiyonu, DataFrame’in satırlarına ya da sütunlarına tek tek uygular.

In [267]:
import pandas as pd
df = pd.DataFrame({"degisken1":[10,23,33,22,11,99],
                   "degisken2":[100,253,333,262,11,969]},
                  columns = ["degisken1","degisken2"])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11         11
5         99        969

In [268]:
df.apply(np.sum)

degisken1     198
degisken2    1928
dtype: int64

In [269]:
df.apply(np.mean)

degisken1     33.000000
degisken2    321.333333
dtype: float64

In [270]:
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                   "degisken1":[10,23,33,22,11,99],
                   "degisken2":[100,253,333,262,11,969]},
                  columns = ["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11         11
5       C         99        969

In [275]:
df.groupby("gruplar").apply(np.sum)

C:\ProgramData\anaconda3\Lib\site-packages\numpy\core\fromnumeric.py:86: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)
C:\ProgramData\anaconda3\Lib\site-packages\numpy\core\fromnumeric.py:86: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)
C:\ProgramData\anaconda3\Lib\site-packages\numpy\core\fromnumeric.py:86: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)
C:\Users\BUSE GÜLÇEN\AppData\Local\Temp\ipykernel_32876\2155945059.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        264
C            CC        132       1302

### Pivot Tablolar

In [278]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")

In [279]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [280]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [282]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [283]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean")

C:\Users\BUSE GÜLÇEN\AppData\Local\Temp\ipykernel_32876\1052603086.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [284]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

C:\Users\BUSE GÜLÇEN\AppData\Local\Temp\ipykernel_32876\3680809584.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [285]:
# pivot() fonksironu ile pivot table

In [286]:
titanic.pivot_table("survived", index = "sex", columns = "class")

C:\Users\BUSE GÜLÇEN\AppData\Local\Temp\ipykernel_32876\1992281764.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [288]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [291]:
age = pd.cut(titanic["age"],[0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [292]:
titanic.pivot_table("survived", ["sex",age], "class")

C:\Users\BUSE GÜLÇEN\AppData\Local\Temp\ipykernel_32876\2298594095.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table("survived", ["sex",age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

## Dış Kaynaktan Veri Okuma

In [293]:
import pandas as pd

In [299]:
# csv dosyasi okuma
pd.read_csv("reading_data/ornekcsv.csv", sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [300]:
# txt dosyasi okuma
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [301]:
# excel dosyasi okuma
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0